In [24]:
import pandas as pd
import numpy as np

In [12]:
data=pd.DataFrame([[50,200],[70,200],[90,200]],index=['samsung','mi','oneplus'],columns=['sale','original'])

In [7]:
pd

In [10]:
data

         sale  original
samsung   100       200
mi        300       400
oneplus   500       600

In [11]:
data.loc['samsung','sale']

100

In [13]:
data

         sale  original
samsung    50       200
mi         70       200
oneplus    90       200

In [20]:
x1=data.loc[data['original']==200]

In [15]:
x1

         sale  original
samsung    50       200
mi         70       200
oneplus    90       200

In [17]:
x1

Empty DataFrame
Columns: [sale, original]
Index: []

In [18]:
x1.shape()

TypeError: 'tuple' object is not callable

In [19]:
x1.shape

(0, 2)

In [21]:
x1

         sale  original
samsung    50       200
mi         70       200
oneplus    90       200

In [22]:
x1.shape

(3, 2)

In [23]:
x1.describe()

       sale  original
count   3.0       3.0
mean   70.0     200.0
std    20.0       0.0
min    50.0     200.0
25%    60.0     200.0
50%    70.0     200.0
75%    80.0     200.0
max    90.0     200.0

In [25]:
x1.loc[x1['original']==200]=100

In [26]:
x1

         sale  original
samsung   100       100
mi        100       100
oneplus   100       100

In [27]:
x1.loc[x1['original']==200]=np.nan

In [28]:
x1

          sale  original
samsung  100.0     100.0
mi       100.0     100.0
oneplus  100.0     100.0

In [29]:
x1.loc[x1['original']==200,'original'] = np.nan

In [30]:
x1

          sale  original
samsung  100.0     100.0
mi       100.0     100.0
oneplus  100.0     100.0

In [31]:
x1.loc[x1['original']==200,'original'] = 400

In [32]:
x1

          sale  original
samsung  100.0     100.0
mi       100.0     100.0
oneplus  100.0     100.0

In [33]:
x1.loc[x1['original']==100,'original'] = 400

In [34]:
x1

          sale  original
samsung  100.0     400.0
mi       100.0     400.0
oneplus  100.0     400.0

In [35]:
x1.loc[x1['original']==400,'original'] = np.nan

In [36]:
x1

          sale  original
samsung  100.0       NaN
mi       100.0       NaN
oneplus  100.0       NaN

In [42]:
x1.loc[x1['original']==np.isnan(),['original']] = 500

ValueError: invalid number of arguments

In [40]:
x1

          sale  original
samsung  100.0       NaN
mi       100.0       NaN
oneplus  100.0       NaN

In [43]:
x1['original']=700

In [44]:
x1

          sale  original
samsung  100.0       700
mi       100.0       700
oneplus  100.0       700

In [45]:
x1.loc[x1['original']==700,['original']] = 500

In [46]:
x1

          sale  original
samsung  100.0       500
mi       100.0       500
oneplus  100.0       500

In [47]:
x1.loc['oneplus','original']=np.nan

In [48]:
x1

          sale  original
samsung  100.0     500.0
mi       100.0     500.0
oneplus  100.0       NaN

In [49]:
x1.dropna()

          sale  original
samsung  100.0     500.0
mi       100.0     500.0

In [50]:
x1

          sale  original
samsung  100.0     500.0
mi       100.0     500.0
oneplus  100.0       NaN

In [51]:
x1.dropna(inplace=True)

In [52]:
x1

          sale  original
samsung  100.0     500.0
mi       100.0     500.0